STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_HAP_Peripheral/STM32_WPAN/App/app_ble.c
          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */
          uint32_t conn_interval_us = 0;
          conn_interval_us = p_conn_update_complete->Conn_Interval * 1250;
          LOG_INFO_APP(">>== HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE\n");
          LOG_INFO_APP("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n",
                       conn_interval_us / 1000,
                       (conn_interval_us%1000) / 10,
                       p_conn_update_complete->Conn_Latency,
                       p_conn_update_complete->Supervision_Timeout*10);
          UNUSED(conn_interval_us);
          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
          break;
        }
        case HCI_LE_PHY_UPDATE_COMPLETE_SUBEVT_CODE:
        {
          hci_le_phy_update_complete_event_rp0 *p_le_phy_update_complete;
          p_le_phy_update_complete = (hci_le_phy_update_complete_event_rp0*)p_meta_evt->data;
          UNUSED(p_le_phy_update_complete);

          /* USER CODE BEGIN EVT_LE_PHY_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_PHY_UPDATE_COMPLETE */
          break;
        }
        case HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_enhanced_connection_complete_event_rp0 *p_enhanced_conn_complete;
          p_enhanced_conn_complete = (hci_le_enhanced_connection_complete_event_rp0 *) p_meta_evt->data;
          UNUSED(p_enhanced_conn_complete);
          /* USER CODE BEGIN HCI_EVT_LE_ENHANCED_CONN_COMPLETE */
          uint32_t conn_interval_us = 0;
          uint8_t type, a_address[6];
          conn_interval_us = p_enhanced_conn_complete->Conn_Interval * 1250;
          LOG_INFO_APP(">>== HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE - Connection handle: 0x%04X\n",
                       p_enhanced_conn_complete->Connection_Handle);
          LOG_INFO_APP("     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      p_enhanced_conn_complete->Peer_Address[5],
                      p_enhanced_conn_complete->Peer_Address[4],
                      p_enhanced_conn_complete->Peer_Address[3],
                      p_enhanced_conn_complete->Peer_Address[2],
                      p_enhanced_conn_complete->Peer_Address[1],
                      p_enhanced_conn_complete->Peer_Address[0]);
          LOG_INFO_APP("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n",
                      conn_interval_us / 1000,
                      (conn_interval_us%1000) / 10,
                      p_enhanced_conn_complete->Conn_Latency,
                      p_enhanced_conn_complete->Supervision_Timeout * 10
                     );
          if (aci_gap_check_bonded_device(p_enhanced_conn_complete->Peer_Address_Type,
                                      &p_enhanced_conn_complete->Peer_Address[0],
                                      &type,
                                      a_address ) == BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP(">>== device is already bonded\n");
          }
          else
          {
            LOG_INFO_APP(">>== device is not bonded\n");
          }
          if (p_enhanced_conn_complete->Status == 0)
          {
            BleConn_t *p_conn = 0;
            for (uint8_t conn = 0; conn < CFG_BLE_NUM_LINK ; conn++)
            {
              if (bleAppContext.BleConn[conn].ConnHandle == 0xFFFF)
              {
                p_conn = &bleAppContext.BleConn[conn];
                bleAppContext.BleConn[conn].ConnHandle = p_enhanced_conn_complete->Connection_Handle;
                break;
              }
            }
            if (p_enhanced_conn_complete->Role == 0x01)
            {
              uint8_t status;
              status = aci_gap_peripheral_security_req(p_enhanced_conn_complete->Connection_Handle);
              if (status != BLE_STATUS_SUCCESS)
              {
                LOG_INFO_APP("==>> aci_gap_peripheral_security_req : Fail, reason: 0x%02X\n", status);
              }
              else
              {
                LOG_INFO_APP("==>> aci_gap_peripheral_security_req : Success\n");
                bleAppContext.connectionHandle = p_enhanced_conn_complete->Connection_Handle;
              }
            }
            if (p_conn != 0)
            {
              p_conn->RemoteAddressType = p_enhanced_conn_complete->Peer_Address_Type;
              MEMCPY(p_conn->aRemoteAddress, p_enhanced_conn_complete->Peer_Address, 6u);
              GATTService_RestoreDatabase(p_conn);
            }

            HAPAPP_AclConnected(p_enhanced_conn_complete->Connection_Handle,
                                p_enhanced_conn_complete->Peer_Address_Type,
                                p_enhanced_conn_complete->Peer_Address,
                                p_enhanced_conn_complete->Role);

          }

          Menu_SetConnectingPage();
          UNUSED(conn_interval_us);

          /* USER CODE END HCI_EVT_LE_ENHANCED_CONN_COMPLETE */
          break; /* HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE */
        }
        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          hci_le_connection_complete_event_rp0 *p_conn_complete;
          p_conn_complete = (hci_le_connection_complete_event_rp0 *) p_meta_evt->data;
          UNUSED(p_conn_complete);
          /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE */
          uint32_t conn_interval_us = 0;
          uint8_t type, a_address[6];
          conn_interval_us = p_conn_complete->Conn_Interval * 1250;
          LOG_INFO_APP(">>== HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE - Connection handle: 0x%04X\n",
                       p_conn_complete->Connection_Handle);
          LOG_INFO_APP("     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      p_conn_complete->Peer_Address[5],
                      p_conn_complete->Peer_Address[4],
                      p_conn_complete->Peer_Address[3],
                      p_conn_complete->Peer_Address[2],
                      p_conn_complete->Peer_Address[1],
                      p_conn_complete->Peer_Address[0]);
          LOG_INFO_APP("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n",
                      conn_interval_us / 1000,
                      (conn_interval_us%1000) / 10,
                      p_conn_complete->Conn_Latency,
                      p_conn_complete->Supervision_Timeout * 10
                     );
          if (aci_gap_check_bonded_device(p_conn_complete->Peer_Address_Type,
                                          &p_conn_complete->Peer_Address[0],
                                          &type,
                                          a_address ) == BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP(">>== device is already bonded\n");
          }
          else
          {
            LOG_INFO_APP(">>== device is not bonded\n");
          }
          if (p_conn_complete->Status == 0)
          {
            BleConn_t *p_conn = 0;
            for (uint8_t conn = 0; conn < CFG_BLE_NUM_LINK ; conn++)
            {
              if (bleAppContext.BleConn[conn].ConnHandle == 0xFFFF)
              {
                p_conn = &bleAppContext.BleConn[conn];
                bleAppContext.BleConn[conn].ConnHandle = p_conn_complete->Connection_Handle;
                break;
              }
            }
            if (p_conn_complete->Role == 0x01)
            {
              uint8_t status;
              status = aci_gap_peripheral_security_req(p_conn_complete->Connection_Handle);
              LOG_INFO_APP(">>== aci_gap_peripheral_security_req executed with status %02X\n", status);
              if (status == BLE_STATUS_SUCCESS)
              {
                bleAppContext.connectionHandle = p_conn_complete->Connection_Handle;
              }
            }
            if (p_conn != 0)
            {
              p_conn->RemoteAddressType = p_conn_complete->Peer_Address_Type;
              MEMCPY(p_conn->aRemoteAddress, p_conn_complete->Peer_Address, 6u);
              GATTService_RestoreDatabase(p_conn);
            }

            HAPAPP_AclConnected(p_conn_complete->Connection_Handle,
                                p_conn_complete->Peer_Address_Type,
                                p_conn_complete->Peer_Address,
                                p_conn_complete->Role);

