STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_HAP_Peripheral/STM32_WPAN/App/app_ble.c
          }

          Menu_SetConnectingPage();
          UNUSED(conn_interval_us);

          /* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
          break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
        }
        /* USER CODE BEGIN SUBEVENT */
        case HCI_LE_REMOTE_CONNECTION_PARAMETER_REQUEST_SUBEVT_CODE:
        {
          hci_le_remote_connection_parameter_request_event_rp0 *req_event = (hci_le_remote_connection_parameter_request_event_rp0 *)p_meta_evt->data;
          hci_le_remote_connection_parameter_request_reply(req_event->Connection_Handle,
                                                           req_event->Interval_Min,
                                                           req_event->Interval_Max,
                                                           req_event->Max_Latency,
                                                           req_event->Timeout,
                                                           0,
                                                           0);
          break; /* HCI_LE_REMOTE_CONNECTION_PARAMETER_REQUEST_SUBEVT_CODE */
        }
        case HCI_LE_CIS_ESTABLISHED_SUBEVT_CODE:
        {
            hci_le_cis_established_event_rp0 *p_cis_established_event;
            p_cis_established_event = (hci_le_cis_established_event_rp0 *) p_meta_evt->data;
            LOG_INFO_APP(">>== HCI_LE_CIS_ESTABLISHED_SUBEVT_CODE - CIS Connection handle: 0x%04X  - Status 0x%02X\n",
                         p_cis_established_event->Connection_Handle,
                         p_cis_established_event->Status);
            if (p_cis_established_event->Status == BLE_STATUS_SUCCESS)
            {
              HAPAPP_CISConnected(p_cis_established_event->Connection_Handle);
              LOG_INFO_APP("CIG_Sync_Delay: %d us, CIS_Sync_Delay: %d us\n",
                         p_cis_established_event->CIG_Sync_Delay[0]  \
                         + (p_cis_established_event->CIG_Sync_Delay[1]<<8) \
                         + (p_cis_established_event->CIG_Sync_Delay[2]<<16),
                         p_cis_established_event->CIS_Sync_Delay[0]  \
                         + (p_cis_established_event->CIS_Sync_Delay[1]<<8) \
                         + (p_cis_established_event->CIS_Sync_Delay[2]<<16));
              LOG_INFO_APP("Transport_Latency_C_To_P: %d us, Transport_Latency_P_To_C: %d us\n",
                         p_cis_established_event->Transport_Latency_C_To_P[0]  \
                         + (p_cis_established_event->Transport_Latency_C_To_P[1]<<8) \
                         + (p_cis_established_event->Transport_Latency_C_To_P[2]<<16),
                         p_cis_established_event->Transport_Latency_P_To_C[0]  \
                         + (p_cis_established_event->Transport_Latency_P_To_C[1]<<8) \
                         + (p_cis_established_event->Transport_Latency_P_To_C[2]<<16));
              LOG_INFO_APP("PHY_C_To_P: 0x%02X, PHY_P_To_C: 0x%02X\n",
                         p_cis_established_event->PHY_C_To_P,
                         p_cis_established_event->PHY_P_To_C);
              LOG_INFO_APP("BN_C_To_P: 0x%02X, BN_P_To_C: 0x%02X\n",
                         p_cis_established_event->BN_C_To_P,
                         p_cis_established_event->BN_P_To_C);
              LOG_INFO_APP("FT_C_To_P: 0x%02X, FT_P_To_C: 0x%02X\n",
                         p_cis_established_event->FT_C_To_P,
                         p_cis_established_event->FT_P_To_C);
              LOG_INFO_APP("Max_PDU_C_To_P: 0x%04X, Max_PDU_P_To_C: 0x%04X\n",
                         p_cis_established_event->Max_PDU_C_To_P,
                         p_cis_established_event->Max_PDU_P_To_C);
              LOG_INFO_APP("NSE: 0x%02X, ISO_Interval: 0x%04X\n",
                         p_cis_established_event->NSE,
                         p_cis_established_event->ISO_Interval);
            }
        }
        break;
        case HCI_LE_CIS_ESTABLISHED_V2_SUBEVT_CODE:
        {
            hci_le_cis_established_v2_event_rp0 *p_cis_established_event;
            p_cis_established_event = (hci_le_cis_established_v2_event_rp0 *) p_meta_evt->data;
            LOG_INFO_APP(">>== HCI_LE_CIS_ESTABLISHED_V2_SUBEVT_CODE - CIS Connection handle: 0x%04X  - Status 0x%02X\n",
                         p_cis_established_event->Connection_Handle,
                         p_cis_established_event->Status);
            if (p_cis_established_event->Status == BLE_STATUS_SUCCESS)
            {
              HAPAPP_CISConnected(p_cis_established_event->Connection_Handle);
              LOG_INFO_APP("CIG_Sync_Delay: %d us, CIS_Sync_Delay: %d us\n",
                         p_cis_established_event->CIG_Sync_Delay[0]  \
                         + (p_cis_established_event->CIG_Sync_Delay[1]<<8) \
                         + (p_cis_established_event->CIG_Sync_Delay[2]<<16),
                         p_cis_established_event->CIS_Sync_Delay[0]  \
                         + (p_cis_established_event->CIS_Sync_Delay[1]<<8) \
                         + (p_cis_established_event->CIS_Sync_Delay[2]<<16));
              LOG_INFO_APP("Transport_Latency_C_To_P: %d us, Transport_Latency_P_To_C: %d us\n",
                         p_cis_established_event->Transport_Latency_C_To_P[0]  \
                         + (p_cis_established_event->Transport_Latency_C_To_P[1]<<8) \
                         + (p_cis_established_event->Transport_Latency_C_To_P[2]<<16),
                         p_cis_established_event->Transport_Latency_P_To_C[0]  \
                         + (p_cis_established_event->Transport_Latency_P_To_C[1]<<8) \
                         + (p_cis_established_event->Transport_Latency_P_To_C[2]<<16));
              LOG_INFO_APP("PHY_C_To_P: 0x%02X, PHY_P_To_C: 0x%02X\n",
                         p_cis_established_event->PHY_C_To_P,
                         p_cis_established_event->PHY_P_To_C);
              LOG_INFO_APP("BN_C_To_P: 0x%02X, BN_P_To_C: 0x%02X\n",
                         p_cis_established_event->BN_C_To_P,
                         p_cis_established_event->BN_P_To_C);
              LOG_INFO_APP("FT_C_To_P: 0x%02X, FT_P_To_C: 0x%02X\n",
                         p_cis_established_event->FT_C_To_P,
                         p_cis_established_event->FT_P_To_C);
              LOG_INFO_APP("Max_PDU_C_To_P: 0x%04X, Max_PDU_P_To_C: 0x%04X\n",
                         p_cis_established_event->Max_PDU_C_To_P,
                         p_cis_established_event->Max_PDU_P_To_C);
              LOG_INFO_APP("NSE: 0x%02X, ISO_Interval: 0x%04X\n",
                         p_cis_established_event->NSE,
                         p_cis_established_event->ISO_Interval);
            }
        }
        break;

        /* USER CODE END SUBEVENT */
        default:
        {
          /* USER CODE BEGIN SUBEVENT_DEFAULT */

          /* USER CODE END SUBEVENT_DEFAULT */
          break;
        }
      }

      /* USER CODE BEGIN META_EVT */

      /* USER CODE END META_EVT */
    }
    break; /* HCI_LE_META_EVT_CODE */

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
    {
      p_blecore_evt = (evt_blecore_aci*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */

      /* USER CODE END EVT_VENDOR */
      switch (p_blecore_evt->ecode)
      {
        /* USER CODE BEGIN ECODE */
        case ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE:
        {
          LOG_INFO_APP(">>== ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE\n");
          break;
        }
        case ACI_GAP_PASS_KEY_REQ_VSEVT_CODE:
        {
          aci_gap_pass_key_req_event_rp0 *p_pass_key;
          p_pass_key = (aci_gap_pass_key_req_event_rp0*)p_blecore_evt->data;
          LOG_INFO_APP(">>== ACI_GAP_PASS_KEY_REQ_VSEVT_CODE\n");

